export const EDULEVEL_OPTION = [
  { value: "null", keywords: "년제" },
  { value: "초등학교", keywords: "초등학교" },
  { value: "중학교", keywords: "중학교" },
  { value: "고등학교", keywords: "고등학교" },
  { value: "대학(2,3년제)", keywords: "대학(2,3년제)" },
  { value: "대학(4년제)", keywords: "대학(4년제)" },
  { value: "대학원", keywords: "대학원" },
];

export const EDUSTATUS_OPTION = [
  { value: "null", keywords: "졸업상태" },
  { value: "재학", keywords: "재학" },
  { value: "중퇴", keywords: "중퇴" },
  { value: "휴학", keywords: "휴학" },
  { value: "졸업예정", keywords: "졸업예정" },
  { value: "졸업", keywords: "졸업" },
];

export const LANGUAGELEVEL_OPTION = [
  { value: "null", keywords: "언어수준" },
  { value: "상", keywords: "상" },
  { value: "중", keywords: "중" },
  { value: "하", keywords: "하" },
];

export const MILITARY_OPTION = [
  { value: "null", keywords: "병역" },
  { value: "해당없음", keywords: "해당없음" },
  { value: "군필", keywords: "군필" },
  { value: "미필", keywords: "미필" },
  { value: "면제", keywords: "면제" },
];

export const KEYWORDS_CHECK = [
  "센스 있어요",
  "집이 가까워요",
  "꼼꼼해요",
  "잘 웃어요",
  "원칙적이에요",
  "습득력이 좋아요",
  "타인과 잘 어울려요",
  "손이 빨라요",
  "배려심 있어요",
  "결근 안해요",
];

export const REQUIRED_FIELD = ["자기소개", "경력", "나의 키워드"];

export const OPTIONAL_FIELD = [
  "최종학력",
  "자격증",
  "수상내역",
  "어학능력",
  "취업우대사항",
  "기타이력서",
];

export const TERMS_SENSITIVE =
  "민감정보는 선택입력항목이며, 입력하지 않더라도 이력서 작성에 제한을 두지 않습니다. 1.개인정보의 수집 및 이용목적 : 효과적인 취업지원, 경력개발에 적합한 서비스를 제공하기 위함. 2.수집하는 개인정보 항목 : 장애여부, 국가보훈, 고용지원금, 병역사항. 3.개인정보의 보유 및 이용기간 : 개인정보의 수집 및 이용에 대한 동의를 철회하거나, 수집 및 이용목적이 달성되거나 이용기간이 종료한 경우 개인정보를 지체 없이 파기. 단, 상법 등 관계법령의 규정에 의하여 보전할 필요가 있는 경우 거래내역과 최소한의 기본정보를 일정기간 보유";

export const TERMS_APPLY = [
  {
    title: "개인정보 필수항목 수집 및 이용동의 (필수)",
    description:
      "기업은 (이하 “회사”라 함)은(는) “Jobkok” 을 통한 채용 절차 진행을 위하여 귀하의 정보를 수집합니다. 1. 수집하는 개인 정보의 필수항목 • 성명, 전화번호, 이메일, 자기소개, 경력사항 2. 개인정보처리의 목적 • 채용 관련 안내, 공지사항 전달, 채용 및 웹사이트 이용 관련 연락, 채용 적합성 판단 및 서류심사/면접 등의 근거 자료, 인재 DB 활용 등 3. 보유기간 • 접수지원 후 3년간, 단 정보주체의 삭제 요청이 있는 경우 지체없이 파기 ※회사는 본인이 작성/제출한 정보에 한하여 정보를 수집합니다. 채용서비스의 특성상 민감한 정보 등이 수집될 수 있으니 작성/제출에 유의하여 주시기 바랍니다. ※ 귀하는 개인 정보 수집ㆍ이용에 대한 동의를 거부할 권리가 있습니다. 그러나 동의를 거부할 경우 원활한 기업 측으로의 지원자 정보 전달을 진행할 수 없어 본건 서비스에 제한을 받을 수 있습니다.",
  },
  {
    title: "개인정보 선택항목 수집 및 이용 동의",
    description:
      "기업 (이하 “회사”라 함)은(는) “Jobkok” 을 통한 채용 절차 진행을 위하여 귀하의 정보를 수집합니다. 1. 수집하는 개인정보의 선택항목 최종학력, 자격증, 수상내역, 어학능력, 취업우대사항, 기타이력서 정보 중 개인식별 가능성이 있는 정보 (해당 내용에 대하여 각 항목별 동의가 일치하지 않을 경우 해당 자료의 처리가 불가능하므로, 직접 기재한 사항에 대하여는 선택적 개인정보 수집 및 이용에 동의하신 것으로 봅니다. 수집 및 이용에 동의하지 않으시는 경우 해당 내용을 삭제하여 주시기 바랍니다) 2. 개인정보처리의 목적 • 채용 관련 안내, 공지사항 전달, 채용 및 웹사이트 이용 관련 연락, 채용 적합성 판단 및 서류심사/면접 등의 근거 자료, 인재 DB 활용 등 3. 보유기간 • 접수 지원 후 3년간, 단 정보주체의 삭제 요청이 있는 경우 지체없이 파기 ※ 회사는 본인이 작성/제출한 정보에 한하여 정보를 수집합니다. 채용서비스의 특성상 민감한 정보 등이 수집될 수 있으니 작성/제출에 유의하여 주시기 바랍니다. ※ 귀하는 개인 정보 수집ㆍ이용에 대한 동의를 거부할 권리가 있습니다. 그러나 동의를 거부할 경우 원활한 기업 측으로의 지원자 정보 전달을 진행할 수 없어 본건 서비스에 제한을 받을 수 있습니다.",
  },
  {
    title: "개인정보처리업무 위탁에 관한 사항 (필수)",
    description:
      "회사는 주식회사 싹쓰리에 채용절차 진행에 관한 업무를 위탁하였으며, 위탁업무 수행 과정에서 개인정보 처리가 수반됩니다. 주식회사 싹쓰리는 개인정보 처리 업무를 수행함에 있어 귀하의 정보를 안전하게 보호할 수 있도록 최선을 다합니다.",
  },
];
